# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 3  # number of classes
depth_multiple: 1  # model depth multiple
width_multiple: 1  # layer channel multiple
anchors: 3  # AutoAnchor evolves 3 anchors per P output layer

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, ConvBNLayer, [32, 4, 4, 0, 1, False, "ReLU"]],  # 0-P1/2
   [-1, 2, FasterNetBlock, []],  # 1-P2/4
   [-1, 1, ConvBNLayer, [64, 2, 2, 0, 1, False, "ReLU"]],
   [-1, 2, FasterNetBlock, []],  # 3-P3/8
   [-1, 1, ConvBNLayer, [128,2, 2, 0, 1, False, "ReLU"]],
   [-1, 8, FasterNetBlock, []],  # 5-P4/16
   [-1, 1, ConvBNLayer, [256,2, 2, 0, 1, False, "ReLU"]],
   [-1, 6, FasterNetBlock, []],  # 7-P5/32
   [-1, 1, ConvBNLayer, [512,2, 2, 0, 1, False, "ReLU" ]],
   [-1, 2, FasterNetBlock, []],  # 9-P6/64
   [-1, 1, SPPF, [512, 5]],  # 10
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [256, 1, 1]],    # 11
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 12
   [[-1, 7], 1, Concat, [1]],  # cat backbone P5   13
   [-1, 1, C3, [256, False]],  # 14

   [-1, 1, Conv, [256, 1, 1]],    # 15
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   # 16
   [[-1, 5], 1, Concat, [1]],  # cat backbone P4   17
   [-1, 1, C3, [256, False]],  # 18

   [-1, 1, Conv, [128, 1, 1]],   # 19
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 20
   [[-1, 3], 1, Concat, [1]],  # cat backbone P3   21
   [-1, 1, C3, [128, False]],  # 22 (P3/8-small)

   [-1, 1, Conv, [128, 3, 2]],   # 23
   [[-1, 19], 1, Concat, [1]],  # cat head P4  24
   [-1, 1, C3, [128, False]],  # 25 (P4/16-medium)

   [-1, 1, Conv, [256, 3, 2]],   #  26
   [[-1, 15], 1, Concat, [1]],  # cat head P5   27
   [-1, 1, C3, [384, False]],  # 28 (P5/32-large)

   [-1, 1, Conv, [384, 3, 2]],    # 29
   [[-1, 11], 1, Concat, [1]],  # cat head P6   # 30
   [-1, 1, C3, [512, False]],  # 31 (P6/64-xlarge)

   [[22, 25, 28, 31], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5, P6)
  ]