# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 3  # number of classes
depth_multiple: 1  # model depth multiple
width_multiple: 1  # layer channel multiple
anchors: 3  # AutoAnchor evolves 3 anchors per P output layer

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, ConvBNLayer, [32, 4, 4, 0, 1, False, "ReLU"]],  # 0-P2/4
   [-1, 1, ConvBNLayer, [64, 2, 2, 0, 1, False, "ReLU"]],  # 1-P3/8
   [-1, 1, FasterNetBlock, []],  # 1+1
   [-1, 1, ConvBNLayer, [128, 2, 2, 0, 1, False, "ReLU"]],  # 3
   [-1, 2, FasterNetBlock, []],  # 3+1-P4/16
   [-1, 1, ConvBNLayer, [256,2, 2, 0, 1, False, "ReLU"]],   # 5
   [-1, 8, FasterNetBlock, []],  # 5+1-P5/32
   [-1, 1, ConvBNLayer, [384,2, 2, 0, 1, False, "ReLU"]],   # 7
   [-1, 6, FasterNetBlock, []],  # 7+1-P6/64
   [-1, 1, SPPF, [256, 5]],  # 8+1
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [256, 1, 1]],    # 9+1
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   # 10+1
   [[-1, 6], 1, Concat, [1]],  # cat backbone P5   11+1
   [-1, 1, C3, [256, False]],  # 12+1

   [-1, 1, Conv, [128, 1, 1]],   # 13+1
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   # 14+1
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3  15+1
   [-1, 1, C3, [128, False]],  # 16+1 (P4/16-small)

   [-1, 1, Conv, [128, 3, 2]],   # 17+1
   [[-1, 14], 1, Concat, [1]],  # cat head P4   18+1
   [-1, 1, C3, [256, False]],  # 19+1 (P5/32-medium)

   [-1, 1, Conv, [256, 3, 2]],   # 20+1
   [[-1, 10], 1, Concat, [1]],  # cat head P5   21+1
   [-1, 1, C3, [512, False]],  # 22+1 (P6/64-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]