# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 3  # number of classes
depth_multiple: 1  # model depth multiple
width_multiple: 1  # layer channel multiple
anchors: 3  # AutoAnchor evolves 3 anchors per P output layer

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, ConvBNLayer, [32, 4, 4, 0, 1, False, "ReLU"]],  # 0-P2/4
   [-1, 1, FasterNetBlock, []],  # 1-P2/4
   [-1, 1, ConvBNLayer, [64, 2, 2, 0, 1, False, "ReLU"]],
   [-1, 2, FasterNetBlock, []],  # 3-P3/8
   [-1, 1, ConvBNLayer, [128,2, 2, 0, 1, False, "ReLU"]],
   [-1, 8, FasterNetBlock, []],  # 5-P4/16
   [-1, 1, ConvBNLayer, [256,2, 2, 0, 1, False, "ReLU"]],
   [-1, 6, FasterNetBlock, []],  # 7-P5/32
   [-1, 1, SPPF, [256, 5]],  # 8
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [256, 1, 1]],    # 9
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   # 10
   [[-1, 5], 1, Concat, [1]],  # cat backbone P4   11
   [-1, 1, C3, [256, False]],  # 12

   [-1, 1, Conv, [128, 1, 1]],   # 13
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   # 14
   [[-1, 3], 1, Concat, [1]],  # cat backbone P3  15
   [-1, 1, C3, [128, False]],  # 16 (P3/8-small)

   [-1, 1, Conv, [128, 3, 2]],   # 17
   [[-1, 13], 1, Concat, [1]],  # cat head P4   18
   [-1, 1, C3, [256, False]],  # 19 (P4/16-medium)

   [-1, 1, Conv, [256, 3, 2]],   # 20
   [[-1, 9], 1, Concat, [1]],  # cat head P5   21
   [-1, 1, C3, [512, False]],  # 22 (P5/32-large)

   [[16, 19, 22], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]